Revit 2027 API
AreaBasedLoadData.LoadClassification Property
 The load classification of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LoadClassification { get; }
Public ReadOnly Property LoadClassification As ElementId
	Get
public:
property ElementId^ LoadClassification {
	ElementId^ get ();
}
member LoadClassification : ElementId with get
Property Value
ElementId
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace